claudiustradamus/stm8s105k-controller/trunk/Project/STM8S_StdPeriph_Template/main.c
/**
   LCD PINOUT
   PINS  1    2    3   4   5   6   7   8   9   10   11   12   13   14    15    16
        VSS  VDD  VO  RS  R/W  E  DB0 DB1 DB2  DB3  DB4  DB5 DB6  DB7  LED_A LED_K
        GND
                      20   22  24                   18    19   21   23
                      3    5   7                    1     2    4    6
   */

/** New Device STM8S105K4  */
/* Controller LCD DS1307,DS18B20 */

/* Daily Allarm ON OFF
                        ON
                        |
  First bit set ON      100H:HHHH MMMM:MMMM
                           OFF
                            |
  Second bit set OFF       010H:HHHH MMMM:MMMM


  Daily Allarm ON TimeLong(in minute for 24h 1440 minute 0x5A0)

  Monthly alarm if enable disable daily alarm on  set date enable daily alarm


*/



/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "stdio.h"
//#include <time.h>
#include "string.h"

/* Private defines -----------------------------------------------------------*/

/* ================ LCD ======================= */

#define LCD_GPIO_PIN (GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7)
#define LCD_PORT (GPIOC)
#define LCD_GPIO_COTROL_PIN (GPIO_PIN_3 | GPIO_PIN_1 |GPIO_PIN_2)
#define DATA4 GPIO_PIN_4
#define DATA5 GPIO_PIN_5
#define DATA6 GPIO_PIN_6
#define DATA7 GPIO_PIN_7
#define EN  GPIO_PIN_3
#define RW  GPIO_PIN_1
#define RS  GPIO_PIN_2
#define lcdLed GPIO_PIN_0
#define LCD_EN(x)  x ? GPIO_WriteHigh(LCD_PORT, EN): GPIO_WriteLow(LCD_PORT,EN); //GPIOB->ODR =(GPIOB->ODR &~PIN_EN)|(x ? PIN_EN :0);
#define LCD_RW(x)  x ? GPIO_WriteHigh(LCD_PORT, RW): GPIO_WriteLow(LCD_PORT,RW);
#define LCD_RS(x)  x ? GPIO_WriteHigh(LCD_PORT, RS): GPIO_WriteLow(LCD_PORT,RS);

#define key_ok    GPIO_PIN_4
#define key_plus  GPIO_PIN_1
#define key_minus GPIO_PIN_2
  //DS18B20  Temp Sensor
#define ds18_data GPIO_PIN_2 //2
#define DS18(x)   x ? GPIO_WriteHigh(GPIOD,ds18_data):GPIO_WriteLow(GPIOD,ds18_data);
  //Power
#define power_pin GPIO_PIN_3



//EEPROM Address;
#define EEPROM_ADDR 0x4000
#define EEPROM_ADR_STATUSH          EEPROM_ADDR + 0
#define EEPROM_ADR_STATUSL          EEPROM_ADDR + 1
#define EEPROM_ADR_PROGRAM          EEPROM_ADDR + 2
//#define EEPROM_ADR_TIME_ON_HOURS    EEPROM_ADDR +2
//#define EEPROM_ADR_TIME_ON_MINUTES  EEPROM_ADDR +3
//#define EEPROM_ADR_TIME_OFF_HOURS   EEPROM_ADDR +4
//#define EEPROM_ADR_TIME_OFF_MINUTES EEPROM_ADDR +5
//#define EEPROM_ADR_MONTH_YEAR       EEPROM_ADDR +6
//#define EEPROM_ADR_MONTH_MONTH      EEPROM_ADDR +7
//#define EEPROM_ADR_MONTH_DATE       EEPROM_ADDR +8





#ifdef __GNUC__
  /* With GCC/RAISONANCE, small printf (option LD Linker->Libraries->Small printf
     set to 'Yes') calls __io_putchar() */
  #define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
  #define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* __GNUC__ */




#define SpecialSymbol 0x1b //Esc to start message
//#define data_size 20
#define key_time 8000
#define key_time_ok 15000
#define key_time_press 4000
#define key_time_release 400
#define DS_Control  0x10  // Out 1s
#define time_menu 10  // 5s
#define TIMEOUT_DS18B20 1000
#define LCDLEDON 20
//#define sync_time 30 // 30s
#define power_jitter 3 //3s




/* Private variables ---------------------------------------------------------*/
volatile u16 timer1;
volatile u16 timer2;
volatile u16 timer3;
volatile u8 timeout;
volatile u16 adcdata;
volatile u8 rx_data;
//char data[data_size];
//u16  measure[data_size];
u8 line_lcd;
u8 count;
u8  seconds;
u8  minutes;
u8  hours;
u8 days=1;
u8  date=1;
u8  month=1;
u8  year;
u8 error;
u8 y,m,d;
u8 temp_flag;
u8 temp2;
u8 daily_hour_on;
u8 daily_minute_on;
u8 daily_hour_off;
u8 daily_minute_off;
u8 monthly_year;
u8 monthly_month;
u8 monthly_date;
//u16 daily_long_on;
u16 time_on;
u16 time_off;
u8 ttimer;
u8 result1;
u8 result2;
u8 result_old;
u8 l=0;
u16 status_check;
u8 test1;
u8 test2;
char  manu_display,sync_display,program_display,program_number;
bool volatile sync_time_ds1307;
u8 lcdLedTimer;
u8 button;
u8 power;
bool blink_flag;
u16 blink_time;
//bool  ds_temperature;



char line1[10];
char line2[10];
//char string1[10];
//char string2[10];
bool change;
bool volatile Time_Display;

//u8 index=0;
float  result;
int volatile k=0;
char *Day_Week[11] = {" Off"," Sun"," Mon"," Tues"," Wednes"," Thurs"," Fri"," Satur"," Daily"," Month"};
//char *test[3] ={"18777","2","3"};

 struct   status_reg
 {
   unsigned manu:1;
   unsigned on:1;
   unsigned timer_on:1;
   unsigned daily:1;
   unsigned monthly:1;
 }  volatile   status  ;


 struct
 {
   unsigned ds1307:1;
   unsigned ds18B20:1;
   unsigned buzzer:1;
   unsigned lcdLed:1;
 }  volatile hardware ;



 typedef  struct
  {
    u8 day;
    u8 onhour ;
    u8 onminute ;
    u8 offhour;
    u8 offminute;

  }  program ;

         // = new proram[8];
   program  programpoint[8];
  /*
   =
 {
   {0x00,0x00,0x00,0x00,0x00},
   {0x00,0x00,0x00,0x00,0x00},
   {0x00,0x00,0x00,0x00,0x00},
   {0x00,0x00,0x00,0x00,0x00},
   {0x00,0x00,0x00,0x00,0x00},
   {0x00,0x00,0x00,0x00,0x00},
   {0x00,0x00,0x00,0x00,0x00},
   {0x00,0x00,0x00,0x00,0x00},
 };
    */

//time_t  ltime;
//struct tm ptim;





/* Private function prototypes -----------------------------------------------*/
void InitHardware();
void GpioConfiguration();
void InitClk();
void InitAdc();
void InitI2C();
void EEPROM_INIT();
bool ReadDS1307();
//void InitUart();
void InitLcd();
void InitDelayTimer2();
void InitDelayTimer3();
void Delay1( u16 Delay);
void Delay2( u16 Delay);
void Delay_us(u16 Delay);
void LCDInstrNibble (u8 Instr);
void LCDInstr(u8 Instr);
void LCDDataOut(u8 data);
void LCD_Busy();
void PulseEnable();
//void SendData();
void SendChar(u8 Char);
//void Send_Hello();
bool Set_Clock();
bool key_ok_on();
bool key_plus_on();
bool key_minus_on();
bool key_ok_plus();
bool Init_DS1307(void);
bool Check_DS1307(void);
bool I2C_Start(void);
bool I2C_WA(u8 address);
bool I2C_WD(u8 data);
bool I2C_RA(u8 address);
bool Set_DS1307();
//bool Set_Delay_Allarm();
bool Set_Timer_On();
bool Set_Timer_Off();
bool Read_Allarm();
bool Read_DS18();
bool DS18_Write( u8 data);
bool DS18_Reset();
bool DS18Set();
u8 temperature();
u8 DS18_Read();
u8 convert_tobcd(u8 data);
u8 I2C_RD(void);
u8 adj(u8 min,u8 max,u8 now);
u8 bcd2hex(u8 bcd);
void Power_On(void);
void Power_Off();
void SaveStatus();
void Rotate_Line( char * line);
void Display_Line(char * line);
void Clear_Line1(void);
void Clear_Line2(void);
void Menu(void);
void pressKey(void);
void Display(void);
bool setData(void);
void initBeep(void);
void beep(u16 Interval);
void FirstMenu();
void ProgramMenu();
void SaveProgram();
void ReadProgram();
void ResetProgram();
void CheckProgramPoint();



u16  Average();


/* Private functions ---------------------------------------------------------*/

void main(void)
{
    /*High speed internal clock prescaler: 1*/
    //CLK_HSIPrescalerConfig(CLK_PRESCALER_HSIDIV1);
    InitClk();
    InitDelayTimer2();
    InitDelayTimer3();
    GpioConfiguration();
    GPIO_WriteLow(GPIOD, power_pin );  //Power Off
    GPIO_WriteLow(GPIOB,lcdLed);
    hardware.lcdLed=0;
    //InitUart();
     enableInterrupts();
     initBeep();
    // GPIO_WriteLow(GPIOD,GPIO_PIN_7); //R/W Line Read Mode
     InitLcd();
    //InitAdc();
     InitI2C();
    // Enable Timer3
    TIM3_Cmd(ENABLE);
    //year=bcd2hex(13);
    //Delay1(10000);
     if (!ReadDS1307())
     {
       printf("\n E2:%d",error);
       // Reset the CPU: Enable the watchdog and wait until it expires
        hardware.ds1307=0;
         pressKey();
      //IWDG->KR = IWDG_KEY_ENABLE;
      // while ( 1 );    // Wait until reset occurs from IWDG
     }
     //Send_Hello();
    //line_lcd=0;
    //printf("\nHello");
      hardware.lcdLed=1;
       lcdLedTimer=LCDLEDON;
        //GPIO_WriteLow(GPIOB,lcdLed);

    if (!Check_DS1307())
    {
       if (error!=0)
       {
        printf("\n E:%d",error);
         pressKey();

