claudiustradamus/stm8s105k-controller/trunk/Project/STM8S_StdPeriph_Template/main.c
   return TRUE;
}
 */

bool Set_Timer_Off()
{

    LCDInstr(0x01);
    Delay1(1000);
    line_lcd=0;
    printf("\nH Off>");
     timer3=0;
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_hour_off=adj(0,23,daily_hour_off);
    } while (timer3<=time_menu && !key_ok_on());

  LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nMin Off>");
   timer3=0;
  do
    {
     line_lcd=1;
     printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
       daily_minute_off=adj(0,59,daily_minute_off);
    } while (timer3<=time_menu && !key_ok_on());

  //Save data to eeprom
     if (!status.monthly) status.daily=1;
       else status.daily=0;
     EEPROM_INIT();
    //u8 temp =*(u8*)(&status);
    // FLASH_ProgramByte(EEPROM_ADR_STATUS,*(u8*)(&status)); //save Status to eeprom
     FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
     FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
     //FLASH_ProgramByte(EEPROM_ADR_TIME_OFF_HOURS,daily_hour_off);
     //FLASH_ProgramByte(EEPROM_ADR_TIME_OFF_MINUTES,daily_minute_off);
     FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
      time_off= daily_hour_off*60+daily_minute_off;
       change=TRUE;
     return TRUE;
}



void SaveStatus()
{
  EEPROM_INIT();
  FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
  FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
  FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
}


void SaveProgram ()
{
     char *pp = (char*)&programpoint[0];
    EEPROM_INIT();
   for( u8 i=0;i< sizeof(programpoint);i++)
   {
    FLASH_ProgramByte( EEPROM_ADR_PROGRAM+i,*(pp+i));
   }
    FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
}


void ReadProgram()
{
    char *pp = (char*)&programpoint[0];
  for( u8 i=0;i< sizeof(programpoint);i++)
   {
     *(pp+i)=FLASH_ReadByte( EEPROM_ADR_PROGRAM+i);
   }
}


void ResetProgram()
{

    EEPROM_INIT();
   for( u8 i=0;i< sizeof(programpoint);i++)
   {
    FLASH_ProgramByte( EEPROM_ADR_PROGRAM+i,0);
   }
    FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data

     //Reload ProgrmaPoint
   ReadProgram();
}

void CheckProgramPoint()
{
   if(status.manu) return;
   u16 timenow=hours*60+minutes;
   status.on=0;
    //u8 daytoday;
     for( u8 i=0; i<8;i++)
     {
        //For Daily Allarm
       if(programpoint[i].day==8)
       {
        int timeon = programpoint[i].onhour * 60 + programpoint[i].onminute;
        int timeoff= programpoint[i].offhour * 60 + programpoint[i].offminute;
            do
              {
               if (timeon == timenow)
                {
                  power = i;
                  status.on=1;
                 break;
                }
               timeon ++;
              if (timeon == 1441) timeon = 0;
              } while (!(timeon==timeoff));
        }

           // for Day of the Week Allarm
        else if (programpoint[i].day== days) //Point is Weekly Mode
        {

        }
       // for Monthly Allarm
        else if (programpoint[i].day == 9)//Point is Monthly Mode
         {
         }


     }




}


bool Read_Allarm()
{
   //daily_hour_on=FLASH_ReadByte(EEPROM_ADR_TIME_ON_HOURS);
    if(daily_hour_on > 24) return FALSE;
   //daily_minute_on=FLASH_ReadByte(EEPROM_ADR_TIME_ON_MINUTES);
    if(daily_minute_on > 59) return FALSE;
   //daily_hour_off=FLASH_ReadByte(EEPROM_ADR_TIME_OFF_HOURS);
    if(daily_hour_off > 24) return FALSE;
   //daily_minute_off=FLASH_ReadByte(EEPROM_ADR_TIME_OFF_MINUTES);
    if(daily_hour_off > 59) return FALSE;
   //monthly_year=FLASH_ReadByte(EEPROM_ADR_MONTH_YEAR);
    if(monthly_year >99) return FALSE;
   //monthly_month=FLASH_ReadByte(EEPROM_ADR_MONTH_MONTH);
    if(monthly_month>12) return FALSE;
   //monthly_date=FLASH_ReadByte(EEPROM_ADR_MONTH_DATE);
    if(monthly_date >31) return FALSE;
  return TRUE;
}

void EEPROM_INIT()
{
  FLASH_DeInit();
  FLASH_Unlock(FLASH_MEMTYPE_DATA);
  FLASH_SetProgrammingTime(FLASH_PROGRAMTIME_STANDARD);



}


void GpioConfiguration()
{

  GPIO_Init(LCD_PORT,(GPIO_Pin_TypeDef)LCD_GPIO_PIN,GPIO_MODE_OUT_PP_HIGH_FAST);

  // ADC PE6 NEW PB0
  GPIO_Init(GPIOB,GPIO_PIN_0,GPIO_MODE_IN_FL_NO_IT);

  // PD6/UART2_RX   PD5/UART2_TX  No need to init  PD7 485 R/W;
  //GPIO_Init(GPIOD,GPIO_PIN_7,GPIO_MODE_OUT_PP_HIGH_FAST);

  //PD0 Led
  GPIO_Init(GPIOD,GPIO_PIN_0,GPIO_MODE_OUT_PP_HIGH_FAST);
  //I2C
  GPIO_Init(GPIOB,GPIO_PIN_4 ,GPIO_MODE_OUT_OD_HIZ_FAST);
  GPIO_Init(GPIOB,GPIO_PIN_5 ,GPIO_MODE_OUT_OD_HIZ_FAST);
  // Remap Pins pb4,pb5  sda,scl ;

   //Init KEY OK,PLUS,MINUS
  GPIO_Init(GPIOF,key_ok,GPIO_MODE_IN_PU_NO_IT);
  GPIO_Init(GPIOA,key_plus,GPIO_MODE_IN_PU_NO_IT);
  GPIO_Init(GPIOA,key_minus,GPIO_MODE_IN_PU_NO_IT);

  //Init DS18b20 data pin
  GPIO_Init(GPIOD,ds18_data,GPIO_MODE_OUT_PP_HIGH_FAST);    //GPIO_MODE_OUT_OD_HIZ_FAST

  // Power Pin
   GPIO_Init(GPIOD,power_pin,GPIO_MODE_OUT_PP_LOW_FAST);

  // lcdLed Pin
   GPIO_Init(GPIOB,lcdLed,GPIO_MODE_OUT_OD_LOW_SLOW);//GPIO_MODE_OUT_PP_HIGH_FAST);


}

void InitClk()
{
  CLK_DeInit();
  CLK_SYSCLKConfig(CLK_PRESCALER_CPUDIV1);    // CPU Prescalar = 1.
  CLK_SYSCLKConfig(CLK_PRESCALER_HSIDIV1);    // Prescalar = 1, 16 MHz.
  CLK_ClockSwitchConfig(CLK_SWITCHMODE_AUTO,  // Automatically switch
  CLK_SOURCE_HSI,       // Switch to internal timer.
  DISABLE,              // Disable the clock switch interrupt.
  CLK_CURRENTCLOCKSTATE_DISABLE);   // Disable the previous clock.

  CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER2 , ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_TIMER3 , ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_UART2,ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_ADC,ENABLE);
  CLK_PeripheralClockConfig(CLK_PERIPHERAL_I2C,ENABLE);


}


/*
void InitAdc()
{
     ADC1_DeInit();
     ADC1_StartConversion();

     //ADC1_Init(ADC1_CONVERSIONMODE_SINGLE,
     //           ADC1_CHANNEL_0,
     //           ADC1_PRESSEL_FCPU_D4,
     //            ADC1_EXTTRIG_TIM,


     ADC1_PrescalerConfig(ADC1_PRESSEL_FCPU_D3);
     ADC1_ConversionConfig( ADC1_CONVERSIONMODE_SINGLE,
                            ADC1_CHANNEL_0,
                            ADC1_ALIGN_RIGHT
                           );


     ADC1_SchmittTriggerConfig(ADC1_SCHMITTTRIG_CHANNEL0,DISABLE);


     //ADC1_Cmd (ENABLE);
     //ADC1->CR1 |= ADC1_CR1_ADON ;
     ADC1_StartConversion();
     ADC1_ITConfig (ADC1_IT_EOCIE,ENABLE);

