claudiustradamus/stm8s105k-controller/trunk/Project/STM8S_StdPeriph_Template/main.c
          if(button==3 || button==0 ) // Minus
          {
             SaveProgram();
              button=0;
             return;
          }


       } while (button != 1 && button != 0);

           // Test programm is Active ?
        if( programpoint[program_number].day !=0)
        {
              //Set On Hour
           Clear_Line1();
           line_lcd=0;
           printf("\nP%d%s",program_number," On");
           timer3=0;
           Clear_Line2();
           do
            {
             line_lcd=1;
             if(blink_flag) printf("\n%02d:%02d",programpoint[program_number].onhour,programpoint[program_number].onminute);
               else printf("\n  :%02d",programpoint[program_number].onminute);
             programpoint[program_number].onhour =adj(0,23,programpoint[program_number].onhour);
            } while ( timer3<=time_menu && !key_ok_on());

              //Set On Minute
            //Clear_Line1();
            //line_lcd=0;
            //printf("\nMin On>");
           // printf("\nP%d%s",program_number," On");
            timer3=0;
          do
            {
             line_lcd=1;
              if(blink_flag) printf("\n%02d:%02d",programpoint[program_number].onhour,programpoint[program_number].onminute);
               else  printf("\n%02d:  ",programpoint[program_number].onhour);
                 programpoint[program_number].onminute=adj(0,59,programpoint[program_number].onminute);
            } while ((timer3<=time_menu)&& !key_ok_on());


           // Set Off Hour

           Clear_Line1();
           line_lcd=0;
           printf("\nP%d%s",program_number," Off");
           timer3=0;
           do
            {
             line_lcd=1;
             if(blink_flag) printf("\n%02d:%02d",programpoint[program_number].offhour,programpoint[program_number].offminute);
               else printf("\n  :%02d",programpoint[program_number].offminute);
             programpoint[program_number].offhour =adj(0,23,programpoint[program_number].offhour);
            } while ( timer3<=time_menu && !key_ok_on());

          //Set Off Minute

          timer3=0;
          do
            {
             line_lcd=1;
              if(blink_flag) printf("\n%02d:%02d",programpoint[program_number].offhour,programpoint[program_number].offminute);
               else  printf("\n%02d:  ",programpoint[program_number].offhour);
                 programpoint[program_number].offminute=adj(0,59,programpoint[program_number].offminute);
            } while ((timer3<=time_menu)&& !key_ok_on());

        }


         program_number++;








       } while ( (program_number < 8) && (button!=0));

         SaveProgram();


}



void Menu (void)
{
 // Clear Display
    LCDInstr(0x01); //Clear LCD
    Delay1(250);
    //u8 key;
 /* First Line 1. Time On 2. Time off 3.Timer ON/OFF 4.Exit
    Wait for Plus,Minius or OK
    If plus next option from Menu on the end EXIT
    If minus previous option from Menu  on the end EXIT
    If OK enter to menu option
    If time out about 10s exit from Menu
 */






    do {

First_Menu:
    line_lcd=0;
    printf("\nON      ");
    line_lcd=1;
    printf("\n%02d:%02d",daily_hour_on,daily_minute_on);
     pressKey();
    switch (button)
        {
        case 1: goto Second_Menu ;
         break;
        case 2: Set_Timer_On();
         break;
        case 3: goto Exit_Menu;
         break;
        }
        break; //Exit Menu


Second_Menu:
    line_lcd=0;
    printf("\nOFF     ");
    line_lcd=1;
    printf("\n%02d:%02d",daily_hour_off,daily_minute_off);
      pressKey();
      switch (button)
        {
        case 1: goto Third_Menu ;
         break;
        case 2: Set_Timer_Off();
         break;
        case 3: goto First_Menu;
         break;
        }
     break; //Exit Menu

Third_Menu:
      line_lcd=0;
    printf("\nMonthly ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",monthly_year,monthly_month,monthly_date);
      pressKey();
      switch (button)
        {
        case 1: goto Fourth_Menu;
         break;
        case 2:
          {
           setData();
           monthly_year=y;
           monthly_month=m;
           monthly_date=d;
           status.monthly=1;
           status.daily=0;  // Disable Daily Alarm On date enable it
           status.on=0;     // Power off
           // Save Status and Date in EEPROM
           EEPROM_INIT();
           FLASH_ProgramByte(EEPROM_ADR_STATUSH,(u8)(*(u16*)(&status)>>8));
           FLASH_ProgramByte(EEPROM_ADR_STATUSL,(u8)(*(u16*)(&status)));
          // FLASH_ProgramByte(EEPROM_ADR_MONTH_YEAR,y);
          // FLASH_ProgramByte(EEPROM_ADR_MONTH_MONTH,m);
          // FLASH_ProgramByte(EEPROM_ADR_MONTH_DATE,d);
           FLASH_Lock(FLASH_MEMTYPE_DATA); //Locking  Flash Data
           break;
          }
        case 3: goto Second_Menu ;
         break;
        }
     break; //Exit Menu


Fourth_Menu:
    line_lcd=0;
    printf("\nClock   ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",hours,minutes,seconds);
      pressKey();
      switch (button)
        {
        case 1: goto Fifth_Menu ;
         break;
        case 2: Set_Clock();
         break;
        case 3: goto Third_Menu;
         break;
        }
     break; //Exit Menu


Fifth_Menu:
    line_lcd=0;
    printf("\nDate    ");
    line_lcd=1;
    printf("\n%02d:%02d:%02d",year,month,date);
      pressKey();
      switch (button)
        {
        case 1: goto Exit_Menu ;
         break;
        case 2: Set_Clock();
         break;
        case 3: goto Fourth_Menu;
         break;
        }
     break; //Exit Menu


Exit_Menu:
    line_lcd=0;
    printf("\nExit OK ");
    line_lcd=1;
    printf("\n+/-     ");
       pressKey();
      switch (button)
        {
        case 1: goto First_Menu;
         break;
        case 2:
         break;
        case 3: goto Fifth_Menu;
         break;
        }
       break; //Exit Menu
    }    while (1);
    //exit:
   Clear_Line1();
   Clear_Line2();

