claudiustradamus/stm8s105k-controller/trunk/Project/STM8S_StdPeriph_Template/main.c
}


void pressKey(void)
{
   button =0;
   timer3=0;
   hardware.lcdLed=1;
   lcdLedTimer=LCDLEDON;
   do
   {
      if (key_ok_on()) button=1;
         else if (key_plus_on())button=2;
        else if (key_minus_on())button=3;
   } while ( (timer3<=time_menu) && !button);    //(timer3<=time_menu) &&

    if (button==0) beep(10000);

   //return button;
}




bool setData(void)
{
   u8 leap=0 ,date_end,month_start=1,date_start=1;
   int yy;

         //Clear Display
   LCDInstr(0x01);
   Delay1(1000);
   line_lcd=0;
   printf("\nYear>");
   y=year;
   m=month;
   d=date;
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",y,m,d);
       y=adj(0,99,y);
    } while (!key_ok_on());
        yy=y+2000;
    if ( yy%400==0 ||(yy%100!=0 && yy%4==0)) leap=1;
        y=yy-2000;
         if(y==year) month_start=month;
     line_lcd=0;
    printf("\nMonth>");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",y,m,d);
      m=adj(month_start,12,m);
    } while (!key_ok_on());

    if ( m == 1 || m==3 || m==5 ||m==7||m==8||m==10||m==12) date_end=31;
     else if ( m==4||m==6 || m==9 ||m==11) date_end=30;
      else
       {
         if(leap) date_end=29;
          else date_end=28;
       }
     if( y==year && m==month) date_start=d;
    LCDInstr(0x01);
     Delay1(1000);
      line_lcd=0;
    printf("\nDate>");
      do
    {
     line_lcd=1;
     printf("\n%02d:%02d:%02d",y,m,d);
       d=adj(date_start,date_end,d);
    } while (!key_ok_on());

      //Set clock keeper
     //year=y;
     //month=m;
     //date=d;
     //Set_DS1307();

  return TRUE;
}


void initBeep(void)
{
  BEEP_DeInit();
  BEEP_Init(BEEP_FREQUENCY_2KHZ);
   BEEP_Cmd(ENABLE);
     Delay1(10000);
   BEEP_Cmd(DISABLE);

}

void beep(u16 Interval)
{

 BEEP_Cmd(ENABLE);
     Delay1(Interval);
  BEEP_Cmd(DISABLE);

}

 PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
      //USART_SendData(USART3, (u8) ch);
     LCD(ch);
   /* Loop until the end of transmission */
    //while(USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET);;
  return ch;
}

 #ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {

  }
}
#endif

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
